fun main() {
    val units = arrayOf("", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать")
    val tens = arrayOf("", "", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто")
    val numb= readLine()!!.toInt()
    if (numb in 0..100) {
        if (numb == 0) {
            println("ноль")
        } else if (numb in 1..19) {
            println(units[numb])
        } else if (numb in 20..99) {
            println(tens[numb / 10] + if (numb % 10 != 0) " " + units[numb % 10] else "")
        } else if (numb == 100) {
            println("сто")
        }
    } else {
        println("Число должно быть в диапазоне от 0 до 100")
    }
}